import React from 'react';

export const PrivacyPolicyText = () => (
  <div className="w-full flex flex-col gap-8">
    {/* Заголовок */}
    <h1 className="font-[var(--font-inter)] font-medium text-[40px] leading-[110%] tracking-[-0.02em] text-white w-[884px]">
      Политика конфиденциальности и порядка обработки персональных данных ООО «Кибершеф»
    </h1>
    
    <div className="flex flex-col gap-6 w-[884px]">
      {/* Раздел 1 */}
      <div className="flex flex-col gap-6 w-[884px]">
        <h2 className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white w-[884px]">
          1. Общие положения, стороны, цель политики
        </h2>
        <p className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white opacity-80 w-[884px]">
          1.1. Настоящая Политика конфиденциальности и обработки персональных данных (далее – «Политика») определяет порядок и условия работы с персональными данными оператора персональных данных Общества с ограниченной ответственностью «Кибершеф» (далее – «Оператор»), в частности порядок работы с информацией о физическом лице, которая может быть получена Оператором от этого физического лица, либо от его законного представителя (далее – «Пользователь», «Субъект персональных данных» либо «Вы»), при возникновении следующих отношений с Субъектом персональных данных: 1.1.1. при использовании функций сайта, расположенного на домене https://cyberchief.ru включая все поддомены и страницы, их содержимое, при участии в рекламных и маркетинговых кампаниях или акциях на указанном домене, а также при использовании любых интернет-сервисов, предлагаемых Оператором к использованию на указанном домене, и/или ином взаимодействии с Оператором на указанном домене (далее вместе – «Сайт»); 1.1.2. при осуществлении Оператором прав и обязанностей, установленных соглашениями/договорами, заключенными в любой форме между Оператором и Пользователем; 1.1.3. при обработке обращений, жалоб, запросов, сообщений, направляемых Оператором и Пользователем друг другу. 1.2. Целью настоящей Политики является установление надлежащего правового режима обработки персональных данных в соответствии с законодательством Российской Федерации. Политика не может содержать положения, которые ограничивают права и свободы субъекта персональных данных, устанавливают случаи обработки персональных данных несовершеннолетних, если иное не предусмотрено законодательством Российской Федерации, либо допускают признание согласия на обработку персональных данных выраженным посредством бездействия субъекта, за исключением случаев, прямо предусмотренных законом.
        </p>
      </div>

      {/* Раздел 2 */}
      <div className="flex flex-col gap-6 w-[884px]">
        <h2 className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white w-[884px]">
          2. Основания обработки персональных данных
        </h2>
        <p className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white opacity-80 w-[884px]">
          2.1. Основаниями обработки персональных данных являются: 2.1.1. согласие на обработку персональных данных, выраженное способом, установленным законом и настоящей Политикой; 2.1.2. соглашения, заключаемые в любой форме между Оператором и Пользователем; 2.1.3. локальные нормативные акты Оператора в области персональных данных. 2.2. Субъект персональных данных принимает решение о предоставлении своих персональных данных и даёт согласие на их обработку добровольно, осознанно, в собственных интересах и по собственной инициативе. Молчание или бездействие субъекта персональных данных не может рассматриваться как выражение согласия. Согласие должно быть конкретным, предметным, информированным, сознательным и недвусмысленным. Согласие с условиями настоящей Политики может быть выражено субъектом персональных данных посредством совершения одного из следующих действий: 2.2.1. простановка символа в чек-боксе (в поле для ввода) на Сайте или в анкете рядом с текстом вида: «Я даю согласие на обработку персональных данных на условиях Политики конфиденциальности», при условии, что Пользователю в каждом месте сбора персональных данных предоставлена возможность ознакомиться с полным текстом настоящей Политики; 2.2.2. нажатие кнопки «зарегистрироваться»/«отправить» на Сайте или сторонних сервисах, при помощи которых Оператор оказывает услуги или предоставляет для ознакомления информацию, при условии, что Пользователю в каждом месте сбора персональных данных предоставлена возможность ознакомиться с полным текстом настоящей Политики.
        </p>
      </div>

      {/* Раздел 3 */}
      <div className="flex flex-col gap-6 w-[884px]">
        <h2 className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white w-[884px]">
          3. Правила обработки персональных данных
        </h2>
        <p className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white opacity-80 w-[884px]">
          3.1. Цель обработки персональных данных, категории и перечень обрабатываемых персональных данных, категории субъектов, персональные данные которых обрабатываются, способы и сроки обработки и хранения, порядок уничтожения персональных данных при достижении целей их обработки или при наступлении иных законных оснований:
        </p>
        <p className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white opacity-80 w-[884px]">
          3.1.1. Цель: связь с Пользователем, направление Пользователю сообщений, уведомлений, запросов, ответов, документов, сообщений рекламного или информационного характера, или иных сообщений или документов, направленных на представление персонализированных предложений и/или улучшения качества услуг. - Категории и перечень обрабатываемых данных: имя, фамилия, отчество, дата рождения, адрес доставки; контактный телефон, сведения об организации, электронная почта, ник в кроссплатформенной системе мгновенного обмена сообщениями Telegram или иных мессенджерах, должность, сведения о стране, городе, области проживания; - Категории субъектов, персональные данные которых обрабатываются: субъекты персональных данных — Пользователи. - Способы обработки: сбор, запись, систематизация, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, обезличивание, блокирование, удаление, уничтожение персональных данных. - Срок обработки и хранения: до получения от субъекта персональных данных требования о прекращении обработки/отзыва согласия либо до достижения целей обработки. - Порядок уничтожения персональных данных при достижении цели их обработки или при наступлении иных законных оснований: лицо, ответственное за обработку персональных данных, производит стирание данных методом перезаписи (замена всех единиц хранения информации на «0») с составлением акта об уничтожении персональных данных. 3.1.2. Цель: обработка обращений, жалоб, запросов, сообщений, направляемых Оператором и Пользователем друг другу в целях обеспечения безопасного и удобного функционала Сайта, эффективному отображению информации и получения обратной связи. - Категории и перечень обрабатываемых данных: имя, фамилия, отчество, дата рождения, адрес доставки; контактный телефон, сведения об организации, электронная почта, ник в кроссплатформенной системе мгновенного обмена сообщениями Telegram или иных мессенджерах, должность, сведения о стране, городе, области проживания, текст сообщения (если текст сообщения содержит персональные данные); - Категории субъектов, персональные данные которых обрабатываются: субъекты персональных данных — Пользователи. - Способы обработки: сбор, запись, систематизация, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, обезличивание, передача (доступ, предоставление) блокирование, удаление, уничтожение персональных данных. - Срок обработки и хранения: до получения от субъекта персональных данных требования о прекращении обработки/отзыва согласия либо до достижения целей обработки. - Порядок уничтожения персональных данных при достижении цели их обработки или при наступлении иных законных оснований: лицо, ответственное за обработку персональных данных, производит стирание данных методом перезаписи (замена всех единиц хранения информации на «0») с составлением акта об уничтожении персональных данных. 3.1.3. Цель: оставление Пользователем отзывов об услугах Оператора для использования их Оператором в рекламных целях. - Категории и перечень обрабатываемых данных: имя, фамилия, отчество, дата рождения, адрес доставки; контактный телефон, сведения об организации, электронная почта, ник в кроссплатформенной системе мгновенного обмена сообщениями Telegram или иных мессенджерах, должность, сведения о стране, городе, области проживания, текст сообщения (если текст сообщения содержит персональные данные); - Категории субъектов, персональные данные которых обрабатываются: субъекты персональных данных — Пользователи. - Способы обработки: сбор, запись, систематизация, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, обезличивание, передача (доступ, предоставление) блокирование, удаление, уничтожение персональных данных. - Срок обработки и хранения: до получения от субъекта персональных данных требования о прекращении обработки/отзыва согласия либо до достижения целей обработки. - Порядок уничтожения персональных данных при достижении цели их обработки или при наступлении иных законных оснований: лицо, ответственное за обработку персональных данных, производит стирание данных методом перезаписи (замена всех единиц хранения информации на «0») с составлением акта об уничтожении персональных данных. 3.1.4. Обработка персональных данных будет ограничиваться достижением этих конкретных, заранее определенных и законных целей. Не допускается обработка персональных данных, несовместимая с целью обработки.
        </p>
      </div>

      {/* Раздел 3.2 */}
      <div className="flex flex-col gap-6 w-[884px]">
        <h2 className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white w-[884px]">
          3.2. О технологии куки (cookie)
        </h2>
        <p className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white opacity-80 w-[884px]">
          3.2.1. Куки (cookies) — это фрагменты данных, которые сервер Оператора направляет и сохраняет на устройстве Субъекта персональных данных при посещении Сайта. Такие файлы могут содержать как персональные данные (например, идентификаторы пользователей), так и обезличенные технические сведения (например, настройки браузера, язык интерфейса, сведения об устройстве), в зависимости от их содержания и способа использования. 3.3. Субъект персональных данных вправе самостоятельно ограничить или запретить приём файлов cookie на своём устройстве с помощью соответствующих настроек браузера или программного обеспечения. При этом Субъект уведомлён, что ограничение или отключение файлов cookie может привести к некорректной работе отдельных функций Сайта. Настройка оборудования и программных средств для обеспечения желаемого уровня защиты и обработки файлов cookie осуществляется Субъектом персональных данных самостоятельно. Оператор не предоставляет технические или юридические консультации по вопросам настройки пользовательского оборудования.
        </p>
      </div>

      {/* Раздел 3.4 */}
      <div className="flex flex-col gap-6 w-[884px]">
        <h2 className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white w-[884px]">
          3.4. Порядок и условия обработки персональных данных
        </h2>
        <p className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white opacity-80 w-[884px]">
          3.4.1. Обработка персональных данных – любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных. В настоящей Политике устанавливаются цели обработки персональных данных, категории и перечень обрабатываемых персональных данных, категории субъектов, персональные данные которых обрабатываются, способы и сроки обработки и хранения, порядок уничтожения персональных данных при достижении целей их обработки или при наступлении иных законных оснований для каждой цели обработки. 3.4.2. Оператор может обрабатывать данные указанными способами (операциями) как в информационных системах персональных данных, так и без использования средств автоматизации. 3.4.3. Оператор будет обрабатывать персональные данные столько времени, сколько это необходимо для достижения конкретной цели обработки. 3.4.4. В случае отзыва субъектом персональных данных согласия на обработку персональных данных или истечения срока действия согласия, направления субъектом персональных данных требования о прекращении обработки персональных данных, Оператор вправе заблокировать данные и обрабатывать их в архивном виде в течение 3 (трёх) лет.
        </p>
      </div>

      {/* Раздел 3.5 */}
      <div className="flex flex-col gap-6 w-[884px]">
        <h2 className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white w-[884px]">
          3.5. Меры по защите персональных данных
        </h2>
        <p className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white opacity-80 w-[884px]">
          3.5.1. Оператор принимает все необходимые меры для защиты персональных данных от несанкционированного, случайного или незаконного уничтожения, потери, изменения, недобросовестного использования, раскрытия или доступа, а также иных незаконных форм обработки. 3.5.2. По умолчанию персональная информация обрабатывается автоматическим оборудованием без доступа к ней кого-либо. В случае если такой доступ понадобится, то Оператор предоставляет доступ к персональным данным только тем лицам, которым эта информация необходима для обеспечения цели обработки. Для защиты и обеспечения конфиденциальности данных такие лица должны обязаться соблюдать внутренние правовые правила и процедуры, технические и организационные меры безопасности в отношении обработки персональной информации. 3.5.3. Как при обработке персональных данных без использования средств автоматизации, так и при автоматизированной обработке обеспечивается достаточная безопасность места, где происходит обработка персональных данных. 3.5.4. Раскрытие персональных данных может быть произведено лишь в соответствии с действующим законодательством Российской Федерации по требованию суда, правоохранительных органов, и в иных предусмотренных законодательством Российской Федерации случаях. 3.5.5. Оператор не проверяет достоверность информации, предоставляемой Субъектом персональных данных, и исходит из того, что Субъект персональных данных в порядке принципа добросовестности и требований ст. 19 Гражданского кодекса РФ предоставляет достоверную и достаточную информацию, заботится о своевременности внесения изменений в ранее предоставленную информацию, актуализирует информацию.
        </p>
      </div>

      {/* Раздел 3.6 */}
      <div className="flex flex-col gap-6 w-[884px]">
        <h2 className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white w-[884px]">
          3.6. Передача персональных данных третьим лицам и распространение персональных данных
        </h2>
        <p className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white opacity-80 w-[884px]">
          3.6.1. Оператор вправе осуществить передачу (способом доступа и предоставления) персональных данных следующим третьим лицам: 3.6.1.1. в случае передачи доступа к Сайту, уступки прав на Сайт, продажи или иного отчуждения Сайта физическому или юридическому лицу. В этом случае новый владелец Сайта обязан соблюдать условия настоящей Политики конфиденциальности или обеспечить принятие аналогичных обязательств по защите персональных данных. 3.6.1.2. любому регулирующему органу, правоохранительным органам, центральным или местным органам власти, другим официальным или государственным органам или судам, которым Оператор обязан по запросу предоставлять информацию в соответствии с применимым законодательством; 3.6.1.3. лицам, осуществляющим обеспечение правовой защиты Оператора или третьих лиц при нарушении их прав либо угрозе нарушения их прав, включая нарушение законов или регулирующих документов; 3.6.1.4. в случае если Субъект персональных данных сам выразил согласие на передачу персональных данных третьему лицу, либо передача персональных данных требуется для исполнения соглашения или договора, заключенного с Субъектом персональных данных. Сюда относятся в том числе случаи, когда Пользователь разрешил своему оборудованию прием, передачу и хранение файлов технологии куки (cookie), если такой файл содержит персональные данные. 3.6.2. Оператор вправе осуществить передачу (способом распространения неограниченному кругу лиц) персональных данных в следующих случаях: 3.6.2.1. Пользователь сам разрешил свободное распространение категорий персональных данных неограниченному кругу лиц.
        </p>
      </div>

      {/* Раздел 3.7 */}
      <div className="flex flex-col gap-6 w-[884px]">
        <h2 className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white w-[884px]">
          3.7. Права и обязанности в отношении персональных данных
        </h2>
        <p className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white opacity-80 w-[884px]">
          3.7.1. Субъект персональных данных обязан заботиться о достоверности предоставленной информации, о своевременности внесения изменений в предоставленную информацию, ее актуализации, в противном случае Оператор не несет ответственности за неисполнение обязательств, любые убытки, вред или потери. 3.7.2. Для реализации права на дополнение, исправление, блокировку и удаление персональных данных, Субъект персональных данных вправе направить письменное обращение на адрес электронной почты Оператора, указанный в настоящей Политике. 3.7.3. Основные права субъекта персональных данных: 3.7.3.1. запрашивать информацию об осуществляемой обработке персональных данных; 3.7.3.2. отзывать согласие на обработку персональных данных; 3.7.3.3. требовать ограничений на обработку персональных данных; 3.7.3.4. требовать прекратить обработку персональных данных, если это предусмотрено применимым законодательством и настоящей Политикой. 3.7.3.5. В случаях, предусмотренных применимым законодательством, Субъект персональных данных обладает другими правами, не указанными выше. 3.7.4. Субъект персональных данных обязуется воспользоваться реквизитами из настоящей Политики для направления запросов о реализации прав субъекта персональных данных или жалоб относительно некорректности информации или незаконности ее обработки. Такие запросы и жалобы рассматриваются в срок, не превышающий 10 (Десяти) рабочих дней с даты поступления Оператору. 3.7.5. Субъект персональных данных вправе в любое время отозвать согласие на обработку персональных данных. Для отзыва согласия на обработку персональных данных Субъект персональных данных направляет Оператору уведомление в письменной форме об отзыве согласия по адресу электронной почты, указанному в разделе реквизитов настоящей Политики.
        </p>
      </div>

      {/* Раздел 3.8 */}
      <div className="flex flex-col gap-6 w-[884px]">
        <h2 className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white w-[884px]">
          3.8. Правила хранения и обработки персональных данных граждан РФ, правила о трансграничной передаче персональных данных
        </h2>
        <p className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white opacity-80 w-[884px]">
          3.8.1. Оператор осуществляет обработку персональных данных граждан Российской Федерации с использованием баз данных, находящихся на территории Российской Федерации. 3.8.2. Оператор до начала осуществления трансграничной передачи персональных данных обязан убедиться в том, что иностранным государством, на территорию которого предполагается осуществлять передачу персональных данных, обеспечивается надежная защита прав субъектов персональных данных и уведомить государственный орган, уполномоченный в сфере персональных данных, о намерении осуществлять трансграничную передачу персональных данных на территории иностранных государств, отвечающих указанным требованиям. 3.8.3. Оператор до начала осуществления трансграничной передачи персональных данных на территорию иностранного государства, в котором не обеспечивается надежная защита прав субъектов персональных данных, обязан получить разрешение государственного органа, уполномоченного в сфере персональных данных, осуществлять трансграничную передачу персональных данных на территории таких иностранных государств.
        </p>
      </div>

      {/* Раздел 4 */}
      <div className="flex flex-col gap-6 w-[884px]">
        <h2 className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white w-[884px]">
          4. Изменение Политики конфиденциальности. Применимое законодательство. Толкование
        </h2>
        <p className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white opacity-80 w-[884px]">
          4.1. Оператор имеет право вносить изменения в настоящую Политику. При внесении изменений в актуальной редакции указывается дата последнего обновления. Новая редакция Политики вступает в силу с момента ее размещения, если иное не предусмотрено новой редакцией Политики. Утратившие силу редакции доступны в архиве по указанному в Политике адресу. 4.2. Оператор информирует субъектов персональных данных, ранее выразивших свое согласие с Политикой, об изменении Политики, руководствуясь при выборе формы информирования тем, что согласие субъекта на обработку персональных данных должно быть конкретным, предметным, информированным, сознательным и однозначным. 4.3. Местом выражения согласия и местом исполнения Политики всегда является место нахождения Оператора, а правом, применимым к отношениям Оператора и Субъекта персональных данных, всегда является право России, вне зависимости от того, где находится Субъект персональных данных или оборудование, используемое им. Все споры и разногласия разрешаются по месту нахождения Оператора, если законом не предусмотрено иное. 4.4. Политика начинает регулировать отношения Субъекта персональных данных и Оператора с момента выражения Субъектом персональных данных согласия с ее условиями и действует бессрочно. Бессрочность действия Политики как документа никаким образом не означает бессрочность/отсутствие ограничений срока обработки персональных данных. Одностороннее прекращение действия Политики по воле одной из сторон не допускается. 4.5. Правила толкования: 4.5.1. Термины «соглашение» и «договор» равнозначны. 4.5.2. Считается, что за словами «включают», «включает», «включая», «например», «к примеру», «в том числе», «такие как» всегда следует словосочетание «но не ограничиваясь», которое не ограничивает общего характера того, что предшествует этим словам. 4.5.3. Считается, что слова «или»/ «либо» понимаются по умолчанию как перечисление, то есть аналогично «и», если из смысла текста прямо не следует, что слово «или»/ «либо» обозначает именно выбор одного из вариантов. 4.5.4. Считается, что значение слова, использованного с заглавной буквы, ничем не отличается от значения этого же слова, использованного со строчной буквы.
        </p>
      </div>

      {/* Раздел 5 */}
      <div className="flex flex-col gap-6 w-[884px]">
        <h2 className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white w-[884px]">
          5. Реквизиты Оператора
        </h2>
        <p className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white opacity-80 w-[884px]">
          Общество с ограниченной ответственностью «Кибершеф» ИНН 9734016610, ОГРН 1257700361621 Адрес: 123592, г. Москва, вн.тер.г. муниципальный округ Строгино, ул. Кулакова, д. 20, к. 1, помещ. 8/1. Номер телефона: +7 (495) 134-63-63 Электронная почта: info@cyberchief.ru 5.1. Информация для реализации прав субъекта персональных данных: Субъект персональных данных может реализовать все права, присущие субъекту персональных данных, а также получить разъяснения по вопросам, касающимся обработки персональных данных, обратившись к Оператору по адресу электронной почты Оператора.
        </p>
      </div>

      {/* Раздел 6 */}
      <div className="flex flex-col gap-6 w-[884px]">
        <h2 className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white w-[884px]">
          6. Сведения о документе
        </h2>
        <p className="font-[var(--font-inter)] font-normal text-xl leading-[135%] tracking-[-0.02em] text-white opacity-80 w-[884px]">
          Дата публикации действующей редакции документа: 22.08.2025 г.
        </p>
      </div>
    </div>
  </div>
);